[{
  "_id": {
    "$oid": "6658d7e2e6f09efb55675769"
  },
  "id": "1",
  "title": "Discovery level",
  "description": "Embark on a journey of wonder and excitement with our Discovery Level program, designed for young explorers aged 6 to 9. Through interactive activities, hands-on experiments, and engaging stories, children will discover the world around them, igniting their curiosity and love for learning. This program covers basic concepts in science, art, and technology, encouraging creativity and critical thinking. With a focus on fun and exploration, Discovery Level aims to build a strong foundation for lifelong learning while nurturing each child's natural inquisitiveness and enthusiasm.",
  "age_group": "Ages 6 - 9",
  "road_map": [
    {
      "id": "667c445898157d488d31854b",
      "week_start": 0,
      "week_end": 1
    }
  ],
  "image": "https://www.rootsofaction.com/wp-content/uploads/2019/01/How-Children-Learn-400x267.jpg"
},
{
  "_id": {
    "$oid": "6658d814e6f09efb5567576a"
  },
  "id": "1",
  "title": "Pathfinder",
  "description": "Our Pathfinder program, tailored for inquisitive minds aged 10 to 13, guides students through an adventurous journey of knowledge and skills. Combining project-based learning with real-world applications, this program covers intermediate topics in STEM, humanities, and the arts. Pathfinders will engage in collaborative projects, problem-solving challenges, and creative endeavors, fostering teamwork, innovation, and analytical thinking. With an emphasis on discovery and experimentation, the Pathfinder program empowers students to explore their passions and develop a deeper understanding of the subjects they love.",
  "age_group": "Ages 10 - 13",
  "road_map": [],
  "image": "https://images.ctfassets.net/p0qf7j048i0q/5NVnSwBXxtPnrOJI1V9LR1/56f136e8dadb6cc67e00dfdc35accadd/G1180016795.png?w=828&q=75&h=828&fm=webp"
},
{
  "_id": {
    "$oid": "6658d832e6f09efb5567576b"
  },
  "id": "1",
  "title": "Masterclass",
  "description": "The Master program, designed for motivated learners aged 14 to 17, offers an advanced, in-depth exploration of academic and practical subjects. This comprehensive program includes rigorous coursework, specialized workshops, and mentorship opportunities in STEM, humanities, arts, and leadership. Masters will undertake complex projects, research initiatives, and skill-building activities that prepare them for higher education and future careers. With a focus on critical thinking, innovation, and real-world application, the Master program cultivates independent thinkers and problem solvers, ready to make significant contributions to their fields and communities.",
  "age_group": "Ages 14 - 17",
  "road_map": [
    {
      "id": "6679ec42f618e6d7fcab539a",
      "week_start": 13,
      "week_end": 16
    }
  ],
  "image": "https://learnenglishteens.britishcouncil.org/sites/teens/files/styles/frontpage_block_middle_promotion/public/field/hero-promo/image/rs9105_gettyimages-1180593998-hig.jpg?itok=4iryrP7V"
}]