{
  "Similarities": [
    {
      "min_score": 140,
      "max_score": 160,
      "comment": {
        "en": "Your child demonstrates exceptional verbal reasoning, identifying abstract relationships and concepts with ease. This strength supports critical thinking and problem-solving skills, preparing them for success in leadership, innovation, and communication-driven fields.",
        "ar": "يُظهر طفلك مهارات لفظية استثنائية، حيث يتعرف بسهولة على العلاقات والأفكار المجردة. تُعزز هذه القوة التفكير النقدي وحل المشكلات، مما يُعدّهم للنجاح في مجالات القيادة والابتكار والتواصل."
      }
    },
    {
      "min_score": 120,
      "max_score": 140,
      "comment": {
        "en": "Your child shows strong verbal reasoning skills, identifying connections and understanding abstract ideas effectively. Encourage reading, discussions, and puzzles to enhance this ability, boosting their academic success and problem-solving proficiency.",
        "ar": "يتمتع طفلك بمهارات لفظية قوية، حيث يُحدد الروابط ويفهم الأفكار المجردة بفعالية. شجّع على القراءة والنقاشات والألغاز لتعزيز هذه القدرة وتحقيق نجاح أكاديمي أكبر."
      }
    },
    {
      "min_score": 100,
      "max_score": 120,
      "comment": {
        "en": "Your child demonstrates good verbal reasoning, identifying basic relationships and abstract concepts. Support their growth through reading comprehension, storytelling, and group discussions to refine reasoning and communication skills.",
        "ar": "يُظهر طفلك مهارات لفظية جيدة، حيث يُحدد العلاقات الأساسية والأفكار المجردة. ادعمه بالقراءة وسرد القصص والمناقشات لتحسين التفكير والتواصل."
      }
    },
    {
      "min_score": 80,
      "max_score": 100,
      "comment": {
        "en": "Your child has developing verbal reasoning skills, identifying simple relationships effectively. Word games, analogies, and reading exercises will strengthen their reasoning abilities and comprehension.",
        "ar": "لدى طفلك مهارات لفظية قيد التطوير، حيث يتعرف على العلاقات البسيطة بفعالية. ستُفيدهم ألعاب الكلمات والتشبيهات وتمارين القراءة في تعزيز مهاراتهم."
      }
    },
    {
      "min_score": 60,
      "max_score": 80,
      "comment": {
        "en": "Your child faces challenges with verbal reasoning, needing support to analyze relationships. Activities like vocabulary exercises and guided reading will help improve their understanding.",
        "ar": "يواجه طفلك صعوبة في التفكير اللفظي، ويحتاج إلى دعم لتحليل العلاقات. ستساعدهم تمارين المفردات والقراءة الموجهة على تحسين فهمهم."
      }
    },
    {
      "min_score": 40,
      "max_score": 60,
      "comment": {
        "en": "Your child struggles with verbal reasoning and needs focused practice. Simple reading, storytelling, and foundational language exercises can help build confidence and understanding over time.",
        "ar": "يُواجه طفلك صعوبة في التفكير اللفظي، ويحتاج إلى تدريب مُركز. يمكن أن تساعد القراءة البسيطة وسرد القصص والتمارين اللغوية الأساسية في بناء الثقة والفهم."
      }
    }
  ],
  "Vocabulary": [
    {
      "min_score": 140,
      "max_score": 160,
      "comment": {
        "en": "Your child exhibits a superior vocabulary and verbal comprehension, easily grasping complex words and concepts. This skill supports their ability to excel in reading, communication, and critical thinking tasks.",
        "ar": "يُظهر طفلك مفردات قوية وفهمًا لفظيًا متفوقًا، حيث يستوعب بسهولة الكلمات والأفكار المعقدة. تُعزز هذه المهارة قدرتهم على التفوق في القراءة والتواصل وحل المشكلات."
      }
    },
    {
      "min_score": 120,
      "max_score": 140,
      "comment": {
        "en": "Your child has a strong vocabulary, demonstrating an excellent grasp of language. They can articulate ideas clearly and understand complex language structures, which helps with communication and learning.",
        "ar": "يتمتع طفلك بمفردات قوية، حيث يُظهر فهمًا ممتازًا للغة. يمكنهم التعبير عن الأفكار بوضوح وفهم الهياكل اللغوية المعقدة، مما يساعد في التواصل والتعلم."
      }
    },
    {
      "min_score": 100,
      "max_score": 120,
      "comment": {
        "en": "Your child has a solid vocabulary, demonstrating an ability to understand and express themselves well in most situations. Encourage reading and conversation to expand their vocabulary further.",
        "ar": "يتمتع طفلك بمفردات جيدة، حيث يظهر قدرة على الفهم والتعبير عن نفسه بشكل جيد في معظم الحالات. شجّع على القراءة والمحادثة لتوسيع مفرداتهم."
      }
    },
    {
      "min_score": 80,
      "max_score": 100,
      "comment": {
        "en": "Your child is developing their vocabulary. They may struggle with complex words but can benefit from more exposure to reading and vocabulary-building exercises to expand their understanding.",
        "ar": "طفلك في مرحلة تطوير مفرداته. قد يواجه صعوبة في الكلمات المعقدة ولكن يمكنه الاستفادة من المزيد من القراءة وتمارين بناء المفردات لتوسيع فهمه."
      }
    },
    {
      "min_score": 60,
      "max_score": 80,
      "comment": {
        "en": "Your child shows a limited vocabulary, requiring support in understanding new words. Encourage consistent reading and use of new vocabulary in daily conversations to improve their language skills.",
        "ar": "يُظهر طفلك مفردات محدودة، ويحتاج إلى دعم في فهم الكلمات الجديدة. شجّع على القراءة المستمرة واستخدام المفردات الجديدة في المحادثات اليومية لتحسين مهاراته اللغوية."
      }
    },
    {
      "min_score": 40,
      "max_score": 60,
      "comment": {
        "en": "Your child struggles with vocabulary and needs focused practice to improve word recognition. Engage in simple vocabulary-building activities to help them increase their language comprehension.",
        "ar": "يواجه طفلك صعوبة في المفردات ويحتاج إلى تدريب مركز لتحسين التعرف على الكلمات. شارك في أنشطة بناء المفردات البسيطة لمساعدتهم على زيادة فهمهم اللغوي."
      }
    }
  ],
  "Visual Puzzles": [
    {
      "min_score": 140,
      "max_score": 160,
      "comment": {
        "en": "Your child exhibits exceptional visual-spatial reasoning, effectively organizing and manipulating shapes and designs. This strength can benefit careers in engineering, architecture, and creative fields requiring design and problem-solving skills.",
        "ar": "يُظهر طفلك مهارات استثنائية في التفكير المكاني البصري، حيث ينظم ويعالج الأشكال والتصاميم بفعالية. ستُفيد هذه القوة في مجالات مثل الهندسة والهندسة المعمارية والوظائف الإبداعية التي تتطلب مهارات التصميم وحل المشكلات."
      }
    },
    {
      "min_score": 120,
      "max_score": 140,
      "comment": {
        "en": "Your child demonstrates solid visual-spatial reasoning skills, able to mentally manipulate shapes and designs effectively. This ability is useful in fields such as design, engineering, and technology.",
        "ar": "يتمتع طفلك بمهارات قوية في التفكير المكاني البصري، حيث يمكنه معالجة الأشكال والتصاميم بفعالية. هذه القدرة مفيدة في مجالات مثل التصميم والهندسة والتكنولوجيا."
      }
    },
    {
      "min_score": 100,
      "max_score": 120,
      "comment": {
        "en": "Your child shows good visual-spatial skills, able to solve puzzles and designs with moderate effort. Encourage more hands-on activities, like building or drawing, to strengthen their abilities.",
        "ar": "يظهر طفلك مهارات جيدة في التفكير المكاني البصري، حيث يمكنه حل الألغاز والتصاميم بجهد معتدل. شجّع على الأنشطة العملية مثل البناء أو الرسم لتعزيز قدراتهم."
      }
    },
    {
      "min_score": 80,
      "max_score": 100,
      "comment": {
        "en": "Your child is developing visual-spatial reasoning skills. With practice in puzzle-solving and visual exercises, they can improve their ability to mentally manipulate shapes and designs.",
        "ar": "طفلك في مرحلة تطوير مهارات التفكير المكاني البصري. مع التدريب في حل الألغاز والتمارين البصرية، يمكنهم تحسين قدرتهم على معالجة الأشكال والتصاميم عقليًا."
      }
    },
    {
      "min_score": 60,
      "max_score": 80,
      "comment": {
        "en": "Your child faces challenges in visual-spatial reasoning, needing support to process shapes and designs. Encourage activities such as building blocks, puzzles, or drawing to boost these skills.",
        "ar": "يواجه طفلك صعوبة في التفكير المكاني البصري، ويحتاج إلى دعم لمعالجة الأشكال والتصاميم. شجّع على الأنشطة مثل مكعبات البناء والألغاز أو الرسم لتحفيز هذه المهارات."
      }
    },
    {
      "min_score": 40,
      "max_score": 60,
      "comment": {
        "en": "Your child struggles with visual-spatial reasoning and would benefit from targeted practice. Simple puzzles, building blocks, and design tasks can improve their spatial awareness.",
        "ar": "يُواجه طفلك صعوبة في التفكير المكاني البصري وسيستفيد من التدريب المركز. الألغاز البسيطة ومكعبات البناء ومهام التصميم يمكن أن تحسن وعيهم المكاني."
      }
    }
  ],
  "Matrix Reasoning": [
    {
      "min_score": 140,
      "max_score": 160,
      "comment": {
        "en": "Your child excels in abstract and logical reasoning, mastering patterns and problem-solving tasks with ease. This ability supports their success in fields such as mathematics, science, and engineering.",
        "ar": "يُظهر طفلك تفوقًا في التفكير المجرد والمنطقي، حيث يتقن الأنماط ومهام حل المشكلات بسهولة. تدعم هذه القدرة نجاحهم في مجالات مثل الرياضيات والعلوم والهندسة."
      }
    },
    {
      "min_score": 120,
      "max_score": 140,
      "comment": {
        "en": "Your child shows strong abstract reasoning abilities, recognizing patterns and solving logical tasks efficiently. This skill is valuable for subjects involving mathematics, computer science, and critical thinking.",
        "ar": "يُظهر طفلك قدرات قوية في التفكير المجرد، حيث يتعرف على الأنماط ويحل المهام المنطقية بكفاءة. هذه المهارة ذات قيمة في المواد التي تتطلب الرياضيات وعلوم الكمبيوتر والتفكير النقدي."
      }
    },
    {
      "min_score": 100,
      "max_score": 120,
      "comment": {
        "en": "Your child demonstrates good logical reasoning, able to identify and solve patterns with moderate effort. More exposure to puzzles and logic games will help strengthen this ability.",
        "ar": "يُظهر طفلك تفكيرًا منطقيًا جيدًا، حيث يمكنه التعرف على الأنماط وحلها بجهد معتدل. المزيد من التعرض للألغاز وألعاب المنطق سيساعد في تعزيز هذه القدرة."
      }
    },
    {
      "min_score": 80,
      "max_score": 100,
      "comment": {
        "en": "Your child is still developing abstract reasoning skills. Practice with puzzles, logic exercises, and pattern recognition tasks will help improve their ability to solve problems efficiently.",
        "ar": "طفلك لا يزال في مرحلة تطوير مهارات التفكير المجرد. سيساعد التدريب على الألغاز وتمارين المنطق ومهام التعرف على الأنماط في تحسين قدرته على حل المشكلات بكفاءة."
      }
    },
    {
      "min_score": 60,
      "max_score": 80,
      "comment": {
        "en": "Your child faces challenges with abstract reasoning. Focusing on exercises that involve pattern recognition, sequencing, and logical problem-solving will improve their abilities over time.",
        "ar": "يواجه طفلك صعوبة في التفكير المجرد. سيساعد التركيز على التمارين التي تتضمن التعرف على الأنماط، والتسلسل، وحل المشكلات المنطقية في تحسين قدراتهم مع مرور الوقت."
      }
    },
    {
      "min_score": 40,
      "max_score": 60,
      "comment": {
        "en": "Your child struggles with abstract reasoning and requires focused practice. Activities like puzzles, matching games, and visual pattern exercises can help strengthen their logical thinking skills.",
        "ar": "يواجه طفلك صعوبة في التفكير المجرد ويحتاج إلى تدريب مركز. الأنشطة مثل الألغاز، وألعاب المطابقة، وتمارين الأنماط البصرية يمكن أن تساعد في تعزيز مهارات التفكير المنطقي."
      }
    }
  ],
  "Figure Weights": [
    {
      "min_score": 140,
      "max_score": 160,
      "comment": {
        "en": "Your child demonstrates strong quantitative reasoning, effortlessly solving complex problems. This ability supports success in mathematics, science, and engineering fields, where logical thinking and quantitative skills are critical.",
        "ar": "يُظهر طفلك قدرة قوية على التفكير الكمي، حيث يحل المشكلات المعقدة بسهولة. تدعم هذه القدرة النجاح في مجالات الرياضيات والعلوم والهندسة، حيث تكون مهارات التفكير المنطقي والكمي ضرورية."
      }
    },
    {
      "min_score": 120,
      "max_score": 140,
      "comment": {
        "en": "Your child shows solid quantitative reasoning skills, capable of solving complex numerical problems with some effort. Continued practice in mathematics and logic will further strengthen these abilities.",
        "ar": "يُظهر طفلك مهارات قوية في التفكير الكمي، حيث يمكنه حل المشكلات العددية المعقدة مع بعض الجهد. سيساعد المزيد من التدريب في الرياضيات والمنطق على تعزيز هذه القدرات."
      }
    },
    {
      "min_score": 100,
      "max_score": 120,
      "comment": {
        "en": "Your child has a good grasp of quantitative reasoning, solving problems with moderate effort. Encouraging practice with math puzzles and logic games will improve their skills.",
        "ar": "يتمتع طفلك بفهم جيد للتفكير الكمي، حيث يحل المشكلات بجهد معتدل. تشجيع التدريب على الألغاز الرياضية وألعاب المنطق سيساعد في تحسين مهاراتهم."
      }
    },
    {
      "min_score": 80,
      "max_score": 100,
      "comment": {
        "en": "Your child is developing quantitative reasoning skills. Practice with basic math problems and puzzles will help improve their problem-solving and logical thinking abilities.",
        "ar": "طفلك في مرحلة تطوير مهارات التفكير الكمي. سيساعد التدريب على المشكلات الرياضية الأساسية والألغاز في تحسين قدراتهم في حل المشكلات والتفكير المنطقي."
      }
    },
    {
      "min_score": 60,
      "max_score": 80,
      "comment": {
        "en": "Your child faces challenges with quantitative reasoning. Support with basic math exercises and visual problem-solving activities will help develop their skills over time.",
        "ar": "يواجه طفلك صعوبة في التفكير الكمي. الدعم من خلال تمارين الرياضيات الأساسية وأنشطة حل المشكلات البصرية سيساعد في تطوير مهاراته مع مرور الوقت."
      }
    },
    {
      "min_score": 40,
      "max_score": 60,
      "comment": {
        "en": "Your child struggles with quantitative reasoning and needs focused practice. Activities that involve number recognition and basic arithmetic can help improve their numerical skills.",
        "ar": "يُواجه طفلك صعوبة في التفكير الكمي ويحتاج إلى تدريب مركز. الأنشطة التي تتضمن التعرف على الأرقام والحسابات الأساسية يمكن أن تساعد في تحسين مهاراتهم العددية."
      }
    }
  ],
  "Digit Span": [
    {
      "min_score": 140,
      "max_score": 160,
      "comment": {
        "en": "Your child excels in working memory, easily retaining and processing information. This skill is crucial for academic success, particularly in tasks requiring focus, attention, and complex problem-solving.",
        "ar": "يُظهر طفلك تفوقًا في الذاكرة العاملة، حيث يمكنه الاحتفاظ بالمعلومات ومعالجتها بسهولة. تُعد هذه المهارة حاسمة للنجاح الأكاديمي، خصوصًا في المهام التي تتطلب التركيز والانتباه وحل المشكلات المعقدة."
      }
    },
    {
      "min_score": 120,
      "max_score": 140,
      "comment": {
        "en": "Your child demonstrates strong working memory, handling information well in various tasks. This skill supports their learning and ability to complete tasks efficiently.",
        "ar": "يُظهر طفلك ذاكرة عاملة قوية، حيث يعالج المعلومات جيدًا في مختلف المهام. تدعم هذه المهارة تعلمهم وقدرتهم على إتمام المهام بكفاءة."
      }
    },
    {
      "min_score": 100,
      "max_score": 120,
      "comment": {
        "en": "Your child has good working memory, processing and remembering information with some effort. Regular practice with memory games and exercises can improve retention and recall.",
        "ar": "يتمتع طفلك بذاكرة عاملة جيدة، حيث يعالج ويتذكر المعلومات مع بعض الجهد. سيساعد التدريب المنتظم على الألعاب والتمارين الذهنية في تحسين الذاكرة والاسترجاع."
      }
    },
    {
      "min_score": 80,
      "max_score": 100,
      "comment": {
        "en": "Your child is developing working memory. Regular activities like memory games or recall exercises can improve their ability to retain and manipulate information.",
        "ar": "طفلك في مرحلة تطوير الذاكرة العاملة. ستساعد الأنشطة المنتظمة مثل الألعاب الذهنية أو تمارين الاسترجاع في تحسين قدرتهم على الاحتفاظ بالمعلومات ومعالجتها."
      }
    },
    {
      "min_score": 60,
      "max_score": 80,
      "comment": {
        "en": "Your child faces challenges with working memory, needing support to hold and process information. Memory exercises and focused practice will strengthen this skill.",
        "ar": "يواجه طفلك صعوبة في الذاكرة العاملة، ويحتاج إلى دعم للاحتفاظ بالمعلومات ومعالجتها. ستساعد التمارين الذهنية والتدريب المركز في تعزيز هذه المهارة."
      }
    },
    {
      "min_score": 40,
      "max_score": 60,
      "comment": {
        "en": "Your child struggles with working memory and needs focused practice. Activities that challenge memory retention and recall will help develop these abilities over time.",
        "ar": "يُواجه طفلك صعوبة في الذاكرة العاملة ويحتاج إلى تدريب مركز. الأنشطة التي تتحدى الاحتفاظ بالذاكرة والاسترجاع سيساعد في تطوير هذه القدرات مع مرور الوقت."
      }
    }
  ],
  "Symbol Search": [
    {
      "min_score": 140,
      "max_score": 160,
      "comment": {
        "en": "Your child has excellent processing speed, able to quickly identify symbols and make decisions. This skill is valuable for tasks that require fast reactions, such as time-sensitive situations or data analysis.",
        "ar": "يتمتع طفلك بسرعة معالجة ممتازة، حيث يمكنه تحديد الرموز واتخاذ القرارات بسرعة. تُعدّ هذه المهارة قيمة في المهام التي تتطلب ردود فعل سريعة، مثل المواقف الحساسة للوقت أو تحليل البيانات."
      }
    },
    {
      "min_score": 120,
      "max_score": 140,
      "comment": {
        "en": "Your child demonstrates good processing speed, efficiently identifying symbols and completing tasks within a reasonable time. Further practice with timed activities will enhance their ability to respond quickly.",
        "ar": "يُظهر طفلك سرعة معالجة جيدة، حيث يحدد الرموز بفعالية ويكمل المهام في وقت معقول. سيساهم التدريب على الأنشطة المحددة بالوقت في تحسين قدرته على الاستجابة بسرعة."
      }
    },
    {
      "min_score": 100,
      "max_score": 120,
      "comment": {
        "en": "Your child shows decent processing speed but may require more time to identify symbols. Targeted exercises in quick decision-making and recognition can help improve their ability to perform tasks faster.",
        "ar": "يُظهر طفلك سرعة معالجة معقولة ولكن قد يحتاج إلى مزيد من الوقت لتحديد الرموز. ستساعد التمارين المستهدفة في اتخاذ القرارات السريعة والتعرف في تحسين قدرته على إتمام المهام بسرعة أكبر."
      }
    },
    {
      "min_score": 80,
      "max_score": 100,
      "comment": {
        "en": "Your child faces challenges with processing speed, needing more time to identify symbols. Practice with pattern recognition and speed-based games will help them improve over time.",
        "ar": "يواجه طفلك صعوبة في سرعة المعالجة، حيث يحتاج إلى وقت أكبر لتحديد الرموز. سيساعده التدريب على التعرف على الأنماط والألعاب المعتمدة على السرعة على التحسن مع مرور الوقت."
      }
    },
    {
      "min_score": 60,
      "max_score": 80,
      "comment": {
        "en": "Your child shows significant challenges with processing speed. Focused practice on quick decision-making and symbol recognition will gradually improve their speed and efficiency.",
        "ar": "يُظهر طفلك تحديات كبيرة في سرعة المعالجة. سيساهم التدريب المركّز على اتخاذ القرارات السريعة والتعرف على الرموز في تحسين سرعته وكفاءته تدريجيًا."
      }
    },
    {
      "min_score": 40,
      "max_score": 60,
      "comment": {
        "en": "Your child struggles with processing speed. Timed exercises and engaging in fast-paced tasks like reaction time games can help them develop quicker response abilities.",
        "ar": "يواجه طفلك صعوبة في سرعة المعالجة. سيساعده التدريب المحدد بالوقت والمشاركة في المهام السريعة مثل ألعاب رد الفعل على تطوير قدراته في الاستجابة السريعة."
      }
    }
  ]
}

